// src/data/homePage/faqData.js

export const faqData = {
    sectionHeader: { header: "ხშირად დასმული კითხვები" },
    questions: [
        { id: 1, title: "როგორ დავიწყოთ თანამშრომლობა Finco-სთან?", content: "დასაწყისში, ჩვენ ვხვდებით თქვენთან, რათა განვიხილოთ თქვენი ბიზნესის სპეციფიკა, საჭიროებები და მიზნები." },
        { id: 2, title: "რას მოიცავს თქვენი ბუღალტრული მომსახურება?", content: "ჩვენი ბუღალტრული მომსახურება მოიცავს სრულ საგადასახადო და ბუღალტრულ აღრიცხვას, ყოველთვიურ დეკლარაციებს და სხვა." },
        // ... Add other FAQ items here
    ]
};