// src/data/homePage/servicesData.js

import Ser1 from '../../../assets/Ser1.svg';
import Ser2 from '../../../assets/Ser2.svg';
import Ser3 from '../../../assets/Ser3.svg';

export const servicesData = {
    sectionHeader: {
        header: "ჩვენი სერვისები",
        paragraph: "გთავაზობთ კომპლექსურ ფინანსურ მომსახურებას, რომელიც მორგებულია თქვენი ბიზნესის საჭიროებებზე."
    },
    services: [
        { id: 1, image: Ser1, header: "ბუღალტრული მომსახურება", paragraph: "სრული ბუღალტრული აღრიცხვა, საგადასახადო დეკლარაციების მომზადება, ფინანსური ანგარიშგება და ანალიზი.", features: ["ყოველდღიური აღრიცხვა", "საგადასახადო დეკლარაციები", "ფინანსური ანგარიშგება"], link: "/accountingservices" },
        { id: 2, image: Ser2, header: "იურიდიული მომსახურება", paragraph: "სამართლებრივი კონსულტაცია, ხელშეკრულებების მომზადება, საგადასახადო დავები და ბიზნესის რეგისტრაცია.", features: ["ბიზნესის რეგისტრაცია", "ხელშეკრულებების მომზადება", "საგადასახადო დავები"], link: "/lawservices" },
        { id: 3, image: Ser3, header: "ფინანსური კონსულტაცია", paragraph: "ბიზნეს გეგმის შემუშავება, ფინანსური ანალიზი, ინვესტიციების დაგეგმვა და ბიუჯეტირება.", features: ["ბიზნეს გეგმები", "ფინანსური ანალიზი", "ბიუჯეტირება"], link: "/consultation" }
    ]
};