import React from 'react';
import FAQitem from './FAQitem';
import SectionHeaders from './SectionHeaders';

const FAQ = () => {
  const questions = [
    {
      title: "როგორ დავიწყოთ თანამშრომლობა Finco-სთან?",
      content: "დასაწყისში, ჩვენ ვხვდებით თქვენთან, რათა განვიხილოთ თქვენი ბიზნესის სპეციფიკა, საჭიროებები და მიზნები. შემდეგ, ჩვენ შევადგენთ მომსახურების პერსონალიზებულ პაკეტს, რომელიც საუკეთესოდ შეესაბამება თქვენს მოთხოვნებს."
    },
    {
      title: "რას მოიცავს თქვენი ბუღალტრული მომსახურება?",
      content: "ჩვენი ბუღალტრული მომსახურება მოიცავს სრულ საგადასახადო და ბუღალტრულ აღრიცხვას, ყოველთვიურ საგადასახადო დეკლარაციებს, ფინანსური ანგარიშგების მომზადებას და ანალიზს, სახელფასო აღრიცხვასა და სხვა აუცილებელ პროცედურებს."
    },
    {
      title: "სად შეიძლება მივიღო დეტალური ინფორმაცია თქვენი სერვისების შესახებ?",
      content: "დეტალური ინფორმაციის მისაღებად ეწვიეთ ჩვენს ოფიციალურ ვებგვერდს, დაგვიკავშირდით ტელეფონის ნომერზე ან მოგვწერეთ ელექტრონულ ფოსტაზე. ჩვენი გუნდი მზად არის გიპასუხოთ ნებისმიერ შეკითხვაზე."
    },
    {
      title: "რა პერიოდულობით უნდა მივაწოდო დოკუმენტაცია?",
      content: "დოკუმენტაციის მოწოდების სიხშირე განისაზღვრება თქვენი ბიზნესის სპეციფიკითა და მომსახურების ტიპით. როგორც წესი, ეს არის ყოველთვიური ან ყოველკვარტალური. ყველა დეტალი შეთანხმდება ხელშეკრულების გაფორმებისას."
    },
    {
      title: "შესაძლებელია თუ არა საწყისი კონსულტაცია უფასოდ?",
      content: "დიახ, ჩვენ გთავაზობთ უფასო საწყის კონსულტაციას, რათა უკეთ გავიგოთ თქვენი საჭიროებები და შემოგთავაზოთ საუკეთესო გადაწყვეტილებები."
    },
    {
      title: "როგორ დავუკავშირდე Finco-ს?",
      content: "დაგვიკავშირდით ჩვენს ნომერზე: +995 32 2 123 456, ან მოგვწერეთ ელექტრონულ ფოსტაზე: info@finco.ge. ასევე შეგიძლიათ შეავსოთ საკონტაქტო ფორმა ჩვენს ვებგვერდზე."
    }
  ];

  return (
    <div className="bg-[#E8EDF2] py-6 px-4 md:px-30">
      <SectionHeaders
        header="ხშირად დასმული კითხვები"
        padding='pt-10'
      />
      <div className="flex flex-col items-center">
        {questions.map((q, index) => (
          <FAQitem
            key={index}
            title={q.title}
            content={q.content}
          />
        ))}
      </div>
    </div>
  );
};

export default FAQ;
